app/Controllers/Auth/Login.php

SELECT *
FROM "users"
WHERE "email" = 'audience@gmail.com'
 LIMIT 1
---
    public function login()
    {
        // Validasi input basic
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()
                ->with('error', $this->validator->getError('email') ?: $this->validator->getError('password'));
        }

        // Normalisasi input
        $email    = strtolower(trim((string) $this->request->getPost('email')));
        $password = (string) $this->request->getPost('password');

        // Ambil user
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();