app/Controllers/Auth/Register.php

SELECT *
FROM "users"
WHERE "email" = 'danditaufik470@gmail.com'
 LIMIT 1
---
    public function store()
    {
        $rules = [
            'nama_lengkap' => 'required|min_length[3]',
            'email'        => 'required|valid_email',
            'password'     => 'required|min_length[6]',
            'password2'    => 'required|matches[password]',
            'role'         => 'permit_empty|in_list[presenter,audience]'
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $email = $this->request->getPost('email');

        // 1) Jika email sudah aktif di USERS -> tolak
        $userModel = new UserModel();
        if ($userModel->where('email', $email)->first()) {