app/Controllers/Role/Presenter/Abstrak.php

SELECT *
FROM "events"
WHERE "events"."id" = 17
---
    public function index()
    {
        $userId = (int) session()->get('id_user');
        $regs   = $this->regModel->listByUser($userId) ?? [];

        // Ambil abstrak terakhir per event
        $allAbs = $this->abstrakModel->getByUserWithDetails($userId) ?? [];
        $latestPerEvent = [];
        foreach ($allAbs as $a) {
            $eid = (int) ($a['event_id'] ?? 0);
            if (!$eid) continue;
            $ts  = !empty($a['tanggal_upload']) ? strtotime($a['tanggal_upload']) : 0;
            $cur = !empty($latestPerEvent[$eid]['tanggal_upload']) ? strtotime($latestPerEvent[$eid]['tanggal_upload']) : -1;
            if (!isset($latestPerEvent[$eid]) || $ts > $cur) $latestPerEvent[$eid] = $a;
        }

        $needsUpload = [];
        $history     = [];

        foreach ($regs as $r) {
            $eid = (int) ($r['id_event'] ?? 0);
            if (!$eid) continue;

            $event = $this->eventModel->find($eid);

SELECT *
FROM "events"
WHERE "events"."id" = 16
---
    public function create($eventId)
{
    $userId  = (int) session()->get('id_user');
    $eventId = (int) $eventId;

    $event = $this->eventModel->find($eventId);

SELECT *
FROM "abstrak"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_abstrak" DESC
 LIMIT 1
---
    }

    // Ambil abstrak terakhir user pada event ini
    $lastAbs = $this->abstrakModel->where('id_user',$userId)
                ->where('event_id',$eventId)->orderBy('id_abstrak','DESC')->first();

SELECT *
FROM "events"
WHERE "events"."id" = 15
---
    public function detail($idAbstrak)
    {
        $userId = (int) session()->get('id_user');
        $row = $this->abstrakModel->getDetailWithRelationsForUser((int)$idAbstrak, $userId);
        if (!$row) {
            return redirect()->to('/presenter/abstrak')
                ->with('error','Abstrak tidak ditemukan.')
                ->with('swal', ['icon'=>'error','title'=>'Gagal','text'=>'Abstrak tidak ditemukan.']);
        }

        $event = $this->eventModel->find((int)$row['event_id']);