app/Controllers/Role/Presenter/Dashboard.php

    private function getAbstractStatus(int $uid, int $eventId): array
    {
        if (!$this->tableExists('abstrak')) return ['has'=>false,'status'=>''];

        $orderCol = $this->pickCol('abstrak', ['updated_at','tanggal_upload','created_at'], 'id_abstrak');

        $row = $this->db->table('abstrak')
            ->select('status')
            ->where('id_user',$uid)->where('event_id',$eventId)
            ->orderBy($orderCol,'DESC')->get()->getRowArray();
---
SELECT "status"
FROM "abstrak"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "tanggal_upload" DESC

    private function getFullpaperMeta(int $uid, int $eventId): array
    {
        $candidates = [];
        if ($this->tableExists('submissions')) $candidates[] = 'submissions';
        if ($this->tableExists('abstrak'))     $candidates[] = 'abstrak';

        foreach ($candidates as $t) {
            $hasPath   = $this->colExists($t,'full_paper_path');
            $hasStatus = $this->colExists($t,'full_paper_status');
            if (!$hasPath && !$hasStatus) continue;

            $orderCol = $this->pickCol($t, ['updated_at','full_paper_uploaded_at','created_at'], $t==='abstrak' ? 'id_abstrak' : 'id');

            $sel = [];
            $sel[] = $hasPath   ? 'full_paper_path AS path' : "NULL AS path";
            $sel[] = $hasStatus ? 'full_paper_status AS status' : "NULL AS status";

            $row = $this->db->table($t)
                ->select(implode(',',$sel), false)
                ->where('id_user',$uid)->where('event_id',$eventId)
                ->orderBy($orderCol,'DESC')->get()->getRowArray();
---
SELECT full_paper_path AS path,full_paper_status AS status
FROM "abstrak"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "full_paper_uploaded_at" DESC

    private function getStats(int $uid): array
    {
        $eventIds = [];
        if ($this->tableExists('abstrak')) {
            foreach ($this->db->table('abstrak')->distinct()->select('event_id')->where('id_user',$uid)->get()->getResultArray() as $r) {
                if (!empty($r['event_id'])) $eventIds[(int)$r['event_id']] = true;
            }
        }
        if ($this->tableExists('pembayaran')) {
            foreach ($this->db->table('pembayaran')->distinct()->select('event_id')->where('id_user',$uid)->get()->getResultArray() as $r) {
                if (!empty($r['event_id'])) $eventIds[(int)$r['event_id']] = true;
            }
        }

        $totalLoa = 0;
        $fpTable = $this->tableExists('submissions') ? 'submissions' : ($this->tableExists('abstrak') ? 'abstrak' : null);
        if ($fpTable && $this->colExists($fpTable, 'full_paper_status')) {
            $whereAccepted = "UPPER(full_paper_status) = 'ACCEPTED'";
            $totalLoa = (int)$this->db->table($fpTable)
                ->where('id_user', $uid)
                ->where($whereAccepted, null, false)
                ->countAllResults();
---
SELECT DISTINCT "event_id"
FROM "abstrak"
WHERE "id_user" = 2
SELECT DISTINCT "event_id"
FROM "pembayaran"
WHERE "id_user" = 2
SELECT COUNT(*) AS "numrows"
FROM "abstrak"
WHERE "id_user" = 2
AND UPPER(full_paper_status) = 'ACCEPTED'

    private function getProgressEvents(int $uid): array
    {
        if (!$this->tableExists('events')) return [];

        $ids = [];
        if ($this->tableExists('abstrak')) {
            foreach ($this->db->table('abstrak')->distinct()->select('event_id')->where('id_user',$uid)->get()->getResultArray() as $r) {
                if (!empty($r['event_id'])) $ids[(int)$r['event_id']] = true;
            }
        }
        if ($this->tableExists('pembayaran')) {
            foreach ($this->db->table('pembayaran')->distinct()->select('event_id')->where('id_user',$uid)->get()->getResultArray() as $r) {
                if (!empty($r['event_id'])) $ids[(int)$r['event_id']] = true;
            }
        }
        if (!$ids) return [];

        $dateCol = $this->pickCol('events', ['event_date','tanggal','date','start_at'], 'event_date');
        $timeCol = $this->pickCol('events', ['event_time','waktu','time','start_time'], 'event_time');

        $events = $this->db->table('events')
            ->select("id,title,{$this->db->protectIdentifiers($dateCol)} AS event_date, {$this->db->protectIdentifiers($timeCol)} AS event_time", false)
            ->whereIn('id', array_keys($ids))
            ->orderBy('event_date','DESC')->get()->getResultArray();
---
SELECT DISTINCT "event_id"
FROM "pembayaran"
WHERE "id_user" = 2
SELECT DISTINCT "event_id"
FROM "abstrak"
WHERE "id_user" = 2
SELECT "id", "title", "event_date", "event_time"
FROM "events"
WHERE "id" IN (16)
ORDER BY "event_date" DESC


            $payVerified=false; $payStatus='';
            if ($this->tableExists('pembayaran')) {
                $pay = $this->db->table('pembayaran')
                    ->select('status,id_pembayaran')
                    ->where('id_user',$uid)->where('event_id',$eventId)
                    ->orderBy('id_pembayaran','DESC')->get()->getRowArray();
---
SELECT "status", "id_pembayaran"
FROM "pembayaran"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_pembayaran" DESC