app/Controllers/Role/Presenter/Event.php

    public function index()
    {
        $userId = (int) session()->get('id_user');
        $q      = trim((string) ($this->request->getGet('q') ?? ''));

        $available = $this->eventModel->getEventsWithOpenRegistration();
        $all       = $this->eventModel->orderBy('event_date', 'DESC')->findAll();
---
SELECT *
FROM "events"
ORDER BY "event_date" DESC

    public function detail($id)
    {
        $userId = (int) session()->get('id_user');
        $event  = $this->eventModel->find((int)$id);
        if (!$event) {
            return redirect()->to('/presenter/events')->with('error', 'Event tidak ditemukan.');
        }

        // enforce deadline
        $this->enforceDeadlinePolicies($event, $userId);

        $reg = $this->regModel->findUserReg((int)$event['id'], $userId);

        $abstrak = $this->abstrakModel
            ->where('id_user', $userId)
            ->where('event_id', (int)$event['id'])
            ->orderBy('id_abstrak', 'DESC')->first();

        $payment = $this->pembayaranModel
            ->where('id_user', $userId)
            ->where('event_id', (int)$event['id'])
            ->orderBy('id_pembayaran', 'DESC')->first();
---
SELECT *
FROM "events"
WHERE "events"."id" = 16
SELECT *
FROM "abstrak"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_abstrak" DESC
 LIMIT 1
SELECT *
FROM "pembayaran"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_pembayaran" DESC
 LIMIT 1

    private function getLatestAbstract(int $eventId, int $userId): ?array
    {
        return $this->abstrakModel
            ->where('id_user', $userId)
            ->where('event_id', $eventId)
            ->orderBy('id_abstrak', 'DESC')->first();
---
SELECT *
FROM "abstrak"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_abstrak" DESC
 LIMIT 1

    private function getLatestPayment(int $eventId, int $userId): ?array
    {
        return $this->pembayaranModel
            ->where('id_user', $userId)
            ->where('event_id', $eventId)
            ->orderBy('id_pembayaran', 'DESC')->first();
---
SELECT *
FROM "pembayaran"
WHERE "id_user" = 2
AND "event_id" = 16
ORDER BY "id_pembayaran" DESC
 LIMIT 1

    private function computeFlowStatus(int $eventId, int $userId): array
    {
        $event = $this->eventModel->find($eventId);
---
SELECT *
FROM "events"
WHERE "events"."id" = 16

                    $can   = ['pay' => true];
                    break;
                case 'verified':
                    $hadir = $this->absensiModel
                        ->where('id_user', $userId)
                        ->where('event_id', $eventId)
                        ->where('status', 'hadir')
                        ->countAllResults() > 0;
---
SELECT COUNT(*) AS "numrows"
FROM "absensi"
WHERE "id_user" = 2
AND "event_id" = 16
AND "status" = 'hadir'