app/Controllers/Role/Presenter/FullPaper.php

SELECT *
FROM "events"
WHERE "events"."id" = 14
---
    public function index()
    {
        $userId = (int) session()->get('id_user');

        $regs      = $this->regModel->listByUser($userId);
        $latestAbs = $this->latestAbstractByEvent($userId);

        $needUpload = [];
        $history    = [];

        foreach ($regs as $r) {
            $eid   = (int) $r['id_event'];
            $event = $this->eventModel->find($eid);