app/Controllers/Profile.php

SELECT *
FROM "users"
WHERE "users"."id_user" = 2
---
    public function index()
    {
        $uid  = (int) session('id_user');
        if (!$uid) return redirect()->to('/auth/login');

        $user = $this->userModel->find($uid);