app/Controllers/Role/Admin/Absensi.php

SELECT *
FROM "events"
WHERE "events"."id" = '16'
---
    public function getEventStatus()
    {
        $eventId = $this->request->getGet('event_id');

        if (!$eventId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Event ID is required'
            ]);
        }

        $event = $this->eventModel->find($eventId);