app/Controllers/Role/Admin/Kategori.php

SELECT COUNT(*) AS "numrows"
FROM "abstrak"
WHERE "id_kategori" = '1'
---
    public function index()
    {
        // Cek role admin
        if (session('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Akses ditolak');
        }

        try {
            // Ambil semua kategori dengan statistik penggunaan
            $kategori = $this->kategoriModel->orderBy('nama_kategori', 'ASC')->findAll();

            // Tambahkan informasi penggunaan untuk setiap kategori
            foreach ($kategori as &$k) {
                $abstrakModel = new \App\Models\AbstrakModel();
                $k['jumlah_abstrak'] = $abstrakModel->where('id_kategori', $k['id_kategori'])->countAllResults();