app/Controllers/Role/Admin/KelolaPaper.php

    public function presenters(int $eventId)
    {
        $abstrak = new AbstrakModel();
        $fpModel = new FullPaperModel();
        $db      = \Config\Database::connect();

        $rows = $abstrak->db->table('abstrak a')
            ->select('a.*, u.nama_lengkap, u.email, k.nama_kategori, e.title AS event_title, e.abstract_deadline, e.full_paper_deadline')
            ->join('users u', 'u.id_user = a.id_user')
            ->join('kategori_abstrak k', 'k.id_kategori = a.id_kategori', 'left')
            ->join('events e', 'e.id = a.event_id', 'left')
            ->where('a.event_id', $eventId)
            ->orderBy('a.tanggal_upload', 'DESC')
            ->get()->getResultArray();
---
SELECT "a".*, "u"."nama_lengkap", "u"."email", "k"."nama_kategori", "e"."title" AS "event_title", "e"."abstract_deadline", "e"."full_paper_deadline"
FROM "abstrak" "a"
JOIN "users" "u" ON "u"."id_user" = "a"."id_user"
LEFT JOIN "kategori_abstrak" "k" ON "k"."id_kategori" = "a"."id_kategori"
LEFT JOIN "events" "e" ON "e"."id" = "a"."event_id"
WHERE "a"."event_id" = 15
ORDER BY "a"."tanggal_upload" DESC


            // === VALIDASI LoA berdasar dokumen tipe 'loa' ===
            if ($dokTblExists) {
                $r['loa_exists'] = (bool) $db->table('dokumen')
                    ->where('id_user', $userId)
                    ->where('event_id', $eventId)
                    ->where('tipe', 'loa')
                    ->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "dokumen"
WHERE "id_user" = 2
AND "event_id" = 15
AND "tipe" = 'loa'

    private function getAbstractReviewSummary(int $idAbstrak): array
    {
        $need = $this->requiredReviewers;
        $out  = ['assigned_count'=>0,'complete_count'=>0,'decisions'=>[],'summary'=>'Belum ada data review'];

        if ($idAbstrak <= 0) return $out;
        $db = \Config\Database::connect();
        if (!$db->tableExists('review')) return $out;

        $rows = $db->table('review r')
            ->select('r.*, u.nama_lengkap AS reviewer_name')
            ->join('users u','u.id_user=r.id_reviewer','left')
            ->where('r.id_abstrak',$idAbstrak)
            ->get()->getResultArray();
---
SELECT "r".*, "u"."nama_lengkap" AS "reviewer_name"
FROM "review" "r"
LEFT JOIN "users" "u" ON "u"."id_user"="r"."id_reviewer"
WHERE "r"."id_abstrak" = 9