app/Models/AbsensiModel.php

    public function hasUserAttended($userId, $eventId)
    {
        if (!$userId || !$eventId) {
            return false;
        }

        return $this->where('id_user', $userId)
                   ->where('event_id', $eventId)
                   ->countAllResults() > 0;
---
SELECT COUNT(*) AS "numrows"
FROM "absensi"
WHERE "id_user" = 2
AND "event_id" = 15

    public function countUserAttendance($userId)
    {
        if (!$userId) {
            return 0;
        }

        return $this->where('id_user', $userId)
                   ->where('status', 'hadir')
                   ->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "absensi"
WHERE "id_user" = 2
AND "status" = 'hadir'