app/Models/AbstrakModel.php

SELECT "abstrak".*, "users"."nama_lengkap", "users"."email", "kategori_abstrak"."nama_kategori", "events"."title" AS "event_title"
FROM "abstrak"
JOIN "users" ON "users"."id_user" = "abstrak"."id_user"
JOIN "kategori_abstrak" ON "kategori_abstrak"."id_kategori" = "abstrak"."id_kategori"
LEFT JOIN "events" ON "events"."id" = "abstrak"."event_id"
WHERE "abstrak"."id_abstrak" = 8
---
    public function getDetailWithRelations(int $idAbstrak): ?array
    {
        $row = $this->db->table($this->table)
            ->select('abstrak.*, users.nama_lengkap, users.email, kategori_abstrak.nama_kategori, events.title AS event_title')
            ->join('users', 'users.id_user = abstrak.id_user')
            ->join('kategori_abstrak', 'kategori_abstrak.id_kategori = abstrak.id_kategori')
            ->join('events', 'events.id = abstrak.event_id', 'left')
            ->where('abstrak.id_abstrak', $idAbstrak)
            ->get()->getRowArray();

SELECT a.*,
                e.title AS event_title,
                e.event_date,
                e.abstract_deadline,
                e.abstract_submission_active,
                k.nama_kategori,
                u.nama_lengkap AS author_name
FROM "abstrak" "a"
LEFT JOIN "events" "e" ON "e"."id" = "a"."event_id"
LEFT JOIN "kategori_abstrak" "k" ON "k"."id_kategori" = "a"."id_kategori"
LEFT JOIN "users" "u" ON "u"."id_user" = "a"."id_user"
WHERE "a"."id_abstrak" = 5
AND "a"."id_user" = 2
---
    public function getDetailWithRelationsForUser(int $abstrakId, int $userId): ?array
    {
        $row = $this->db->table('abstrak a')
            ->select("
                a.*,
                e.title AS event_title,
                e.event_date,
                e.abstract_deadline,
                e.abstract_submission_active,
                k.nama_kategori,
                u.nama_lengkap AS author_name
            ", false)
            ->join('events e', 'e.id = a.event_id', 'left')
            ->join('kategori_abstrak k', 'k.id_kategori = a.id_kategori', 'left')
            ->join('users u', 'u.id_user = a.id_user', 'left')
            ->where('a.id_abstrak', $abstrakId)
            ->where('a.id_user', $userId)
            ->get()->getRowArray();