app/Models/EventModel.php

SELECT *
FROM "events"
WHERE "events"."id" = 16
---
    public function getEventPrice($eventId, $userRole, $participationType)
    {
        $event = $this->find($eventId);

SELECT *
FROM "events"
WHERE "events"."id" = 16
---
    public function isAbstractSubmissionOpen($eventId)
    {
        $event = $this->find($eventId);

SELECT *
FROM "events"
WHERE "is_active" = TRUE
AND "registration_active" = TRUE
AND "event_date" >= '2025-09-26'
AND   (
"registration_deadline" IS NULL
OR "registration_deadline" >= '2025-09-26 13:02:59'
 )
ORDER BY "event_date" ASC
---
    public function getEventsWithOpenRegistration()
    {
        $currentDateTime = date('Y-m-d H:i:s');

        return $this->where('is_active', true)
                   ->where('registration_active', true)
                   ->where('event_date >=', date('Y-m-d'))
                   ->groupStart()
                       ->where('registration_deadline IS NULL')
                       ->orWhere('registration_deadline >=', $currentDateTime)
                   ->groupEnd()
                   ->orderBy('event_date', 'ASC')
                   ->findAll();