app/Models/EventRegistrationModel.php

SELECT *
FROM "event_registrations"
WHERE "id_event" = 16
AND "id_user" = 2
ORDER BY "id" DESC
 LIMIT 1
---
    public function findUserReg(int $idEvent, int $idUser): ?array
    {
        return $this->where(['id_event' => $idEvent, 'id_user' => $idUser])
                    ->orderBy('id', 'DESC')
                    ->first();

SELECT "event_registrations".*, "e"."title" AS "event_title", "e"."event_date", "e"."event_time"
FROM "event_registrations"
LEFT JOIN "events" "e" ON "e"."id" = "event_registrations"."id_event"
WHERE "event_registrations"."id_user" = 2
ORDER BY "event_registrations"."id" DESC
---
    public function listByUser(int $idUser): array
    {
        return $this->select('event_registrations.*, e.title AS event_title, e.event_date, e.event_time')
                    ->join('events e', 'e.id = event_registrations.id_event', 'left')
                    ->where('event_registrations.id_user', $idUser)
                    ->orderBy('event_registrations.id','DESC')
                    ->findAll();