app/Models/PembayaranModel.php

    public function getByMidtransOrderId($orderId)
    {
        if (empty($orderId)) {
            return null;
        }

        return $this->where('midtrans_order_id', $orderId)->first();
---
SELECT *
FROM "pembayaran"
WHERE "midtrans_order_id" = 'payment_notif_test_G290320851_be1f4e75-d56a-4f52-badf-e1c06ec59797'
 LIMIT 1