app/Models/ReviewModel.php

SELECT "review".*, "users"."nama_lengkap" AS "reviewer_name", "users"."email" AS "reviewer_email"
FROM "review"
JOIN "users" ON "users"."id_user" = "review"."id_reviewer"
WHERE "review"."id_abstrak" = 8
ORDER BY "review"."tanggal_review" DESC
---
    public function getByAbstrakWithReviewer(int $idAbstrak): array
    {
        return $this->db->table($this->table)
            ->select('review.*, users.nama_lengkap AS reviewer_name, users.email AS reviewer_email')
            ->join('users', 'users.id_user = review.id_reviewer')
            ->where('review.id_abstrak', $idAbstrak)
            ->orderBy('review.tanggal_review', 'DESC')
            ->get()->getResultArray();